Revit 2024 API
FamilyInstanceCreationData Members
The FamilyInstanceCreationData type exposes the following members.
Constructors
Name | Description
FamilyInstanceCreationData(Object)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(FamilySymbol, IList<XYZ>)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(Face, Line, FamilySymbol)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(Curve, FamilySymbol, Level, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, Element, Level, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, XYZ, Element, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Axis
 Get or set the axis of the FamilyInstance
RotateAngle
 Get or set the rotate angle of the FamilyInstance
See Also
FamilyInstanceCreationData Class
Autodesk.Revit.Creation Namespace